# Main_unit_DZ

## Задача
*Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

## Решение
* Реализация ввода данных(массива) с клавиатуры.
```sh
функция: "CrateArray".
``` 
* Реализация вывода данных в консоль. 
```sh
функция: "PrintArrey".
``` 
* Реализация алгоритма выбора значений(элементов массива), удовлетворяющих условию задачи(массив строк, длина которых меньше, либо равна 3 символам) и формирование из них нового массива.
```sh
функция: "CrateNewArray".
``` 
* Основной код(ввод размера исходного массива и использование функций)
```sh
Console.Write("Введите кол-во элементов массива: ");
int n = Convert.ToInt32(Console.ReadLine());
string [] array = CrateArray(n);
PrintArrey(array);
PrintArrey(CrateNewArray(array));.
``` 